# SetExportFontTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..SetExportFontTable Method
BaseExportOptions Class See Also
---
Sets font table to option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetExportFontTable(
	ExportFontTable fontTable
)
```

Visual Basic
---
```text
Public Sub SetExportFontTable ( _
	fontTable As ExportFontTable _
)
```

Visual C++
---
```text
public:
void SetExportFontTable(
	ExportFontTable^ fontTable
)
```

# ### Parameters
fontTable
    Type: Autodesk.Revit.DB..::..ExportFontTable The font table to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace